app/views/professors/show.html.erb

  <div class="col-md-8">
    <% if @professor.reviews.any? %>
---
SELECT  1 AS one FROM "reviews" WHERE "reviews"."professor_id" = ? LIMIT 1  [["professor_id", 3]]