app/controllers/professors_controller.rb

SELECT  "professors".* FROM "professors" WHERE "professors"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."professor_id" = ?  ORDER BY "reviews"."created_at" DESC LIMIT 30 OFFSET 0  [["professor_id", 1]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."professor_id" = ?  [["professor_id", 1]]
---
  def show
    @professor = Professor.find(params[:id])
    @reviews = @professor.reviews.paginate(page: params[:page])

INSERT INTO "professors" ("first_name", "last_name", "netid", "department", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["first_name", "Henry"], ["last_name", "Farber"], ["netid", "farber"], ["department", "Economics"], ["created_at", "2015-04-21 04:27:59.988049"], ["updated_at", "2015-04-21 04:27:59.988049"]]
---
  def create
    @professor = Professor.new(professor_params)
    if @professor.save

SELECT  "professors".* FROM "professors" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "professors"
---
  def index
    if params[:query].present?
      # split query into 4 fields
      search_strings = params[:query].split
      if search_strings.length == 4
        @professors = Professor.search(search_strings[0],
                                       fields: [:first_name],
                                       page: params[:page])